Revit 2026 API

# DockablePanes Class

---

Provides a container of all Revit built-in DockablePaneId instances.

SystemObject Autodesk.Revit.UIDockablePanes

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DockablePanes
```
```vb
Public NotInheritable Class DockablePanes
```
```cpp
public ref class DockablePanes abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DockablePanes = class end
```

#### Reference

Autodesk.Revit.UI Namespace